#===============================
#     判定式の簡素な書き方
#===============================
a = b = c = None
if a is b is c is None:
    print("すべてNone")

d = 3
if 0 < d < 5:
    print("d は 0～5の間")



#===============================
#         複数戻り値
#===============================
def multi_return_value():
    return 4, 5, 6

o, p, q = multi_return_value()
print(o, p, q) #=> 4 5 6



#===============================
#  変数が定義されているかチェック
#===============================
e = e if "e" in locals() else 1  # eがローカル変数として定義されていれば eの値を、されていなければ 1を返す。
print(e) #=> 1

f = 5
f = f if "e" in globals() else 1  # fがグローバル変数として定義されていれば fの値を、されていなければ 1を返す。
print(f) #=> 5


#===============================
#       タプルの省略記述
#===============================
tuple1 = 1, 2, 3 #()を省略して書くと、tupleとなる。
print(tuple1) #=> (1, 2, 3)


x, y, z = (1, 2, 3)
print(x, y, z) #=> 1 2 3


